In [1]:
import warnings
warnings.filterwarnings('ignore', category=DeprecationWarning)
warnings.filterwarnings('ignore', category=UserWarning)

import psycopg2 
import pandas as pd
import matplotlib.pyplot as plt
import numpy as np
import seaborn as sns
from dotenv import load_dotenv
import os

In [2]:
load_dotenv()
USER = os.environ.get('POSTGRES_USER')
PASSWORD = os.environ.get('POSTGRES_PASSWORD')
DB = os.environ.get('POSTGRES_DB_stepik')

conn_string = psycopg2.connect(f"dbname={DB} user='{USER}' host='localhost' password='{PASSWORD}'")
cursor = conn_string.cursor()
cursor.execute("SELECT version();")
record = cursor.fetchone()
print(f"Подключение к {record} выполнено")

Подключение к ('PostgreSQL 15.8 (Debian 15.8-1.pgdg120+1) on x86_64-pc-linux-gnu, compiled by gcc (Debian 12.2.0-14) 12.2.0, 64-bit',) выполнено

In [3]:
# 1. Вывести информацию о всех книгах, хранящихся на складе.
query = ('  select * \
            from book')
data = pd.read_sql(query, con=conn_string)
data

   book_id                  title            author   price  amount
0        1     Мастер и Маргарита     Булгаков М.А.  670.99       3
1        2          Белая гвардия     Булгаков М.А.  540.50       5
2        3                  Идиот  Достоевский Ф.М.  460.00      10
3        4      Братья Карамазовы  Достоевский Ф.М.  799.01       3
4        5                  Игрок  Достоевский Ф.М.  480.50      10
5        6  Стихотворения и поэмы       Есенин С.А.  650.00      15

In [4]:
# 2. Выбрать названия книг и авторов из таблицы book, для поля title задать имя(псевдоним) Название, для поля author –  Автор.
query = ('  select title as Название, author as Автор \
            from book;')
data = pd.read_sql(query, con=conn_string)
data

                Название             Автор
0     Мастер и Маргарита     Булгаков М.А.
1          Белая гвардия     Булгаков М.А.
2                  Идиот  Достоевский Ф.М.
3      Братья Карамазовы  Достоевский Ф.М.
4                  Игрок  Достоевский Ф.М.
5  Стихотворения и поэмы       Есенин С.А.

In [5]:
# 3. Для упаковки каждой книги требуется один лист бумаги, цена которого 1 рубль 65 копеек. Посчитать стоимость упаковки для каждой книги 
# (сколько денег потребуется, чтобы упаковать все экземпляры книги). В запросе вывести название книги, ее количество и стоимость упаковки, 
# последний столбец назвать pack. 
query = ('  select title, amount, amount * 1.65 as pack \
            from book;')
data = pd.read_sql(query, con=conn_string)
data

                   title  amount   pack
0     Мастер и Маргарита       3   4.95
1          Белая гвардия       5   8.25
2                  Идиот      10  16.50
3      Братья Карамазовы       3   4.95
4                  Игрок      10  16.50
5  Стихотворения и поэмы      15  24.75

In [6]:
# 4. В конце года цену каждой книги на складе пересчитывают – снижают ее на 30%. Написать SQL запрос, который из таблицы book выбирает названия, авторов, количества и 
# вычисляет новые цены книг. Столбец с новой ценой назвать new_price, цену округлить до 2-х знаков после запятой.
query = ('  select title, author, amount, \
            round((price*0.7),2) as new_price \
            from book;')
data = pd.read_sql(query, con=conn_string)
data

                   title            author  amount  new_price
0     Мастер и Маргарита     Булгаков М.А.       3     469.69
1          Белая гвардия     Булгаков М.А.       5     378.35
2                  Идиот  Достоевский Ф.М.      10     322.00
3      Братья Карамазовы  Достоевский Ф.М.       3     559.31
4                  Игрок  Достоевский Ф.М.      10     336.35
5  Стихотворения и поэмы       Есенин С.А.      15     455.00

In [7]:
query = (f' select title, amount, amount * 1.65 as pack \
            from book;')
data = pd.read_sql(query, con=conn_string)
data

                   title  amount   pack
0     Мастер и Маргарита       3   4.95
1          Белая гвардия       5   8.25
2                  Идиот      10  16.50
3      Братья Карамазовы       3   4.95
4                  Игрок      10  16.50
5  Стихотворения и поэмы      15  24.75

In [8]:
query = (f' select title, amount, amount * 1.65 as pack \
            from book;')
data = pd.read_sql(query, con=conn_string)
data

                   title  amount   pack
0     Мастер и Маргарита       3   4.95
1          Белая гвардия       5   8.25
2                  Идиот      10  16.50
3      Братья Карамазовы       3   4.95
4                  Игрок      10  16.50
5  Стихотворения и поэмы      15  24.75